<template>
    <NuxtLayout name="personal-center">
        <div>
            <CoreshopTitle title="隱私條款"></CoreshopTitle>
            <div class="cs-p-10 cs-background-color-white">
                <h2 class="cs-font-size-16 cs-text-align-center cs-p-10">隱私條款</h2>
                <div class="cs-font-size-14 cs-text-align-center cs-p-10">此隱私條款最後更新於 2024年2月29日</div>
                <div class="cs-font-size-14">
                    <p>快樂搬馬管理顧問有限公司隱私條款(下稱為“本隱私條款”或“本政策”)適用於快樂搬馬網站（含手機端）（以下稱為“快樂搬馬官網”）以上提供的產品和服務，向您闡釋快樂搬馬管理顧問有限公司(以下稱為“快樂搬馬”或“我們”)
                        在您使用快樂搬馬官網時如何處理您的個人資訊。</p>
                    <p>
                        我們向您提供的產品或服務如單獨設有隱私條款的，則相應產品或服務適用特定的隱私條款。請您注意，
                        本政策不適用於您通過我們的產品/服務而接入的其他協力廠商產品/服務(“其他協力廠商”，包括但不限於任何協力廠商網站以及協力廠商服務提供者等)，
                        具體規定請參照該協力廠商的隱私條款或類似聲明。</p>
                    <p>
                        本隱私條款將幫助您瞭解：</p>
                    <p>
                        當您瀏覽快樂搬馬官網時，為實現功能、服務所必需，我們可能會處理您的相關個人資訊。
                        除非是為實現基本業務功能或根據法律法規要求所必需的必要信息，您均可以拒絕提供且不影響其他功能或服務
                        。我們會遵循本隱私條款處理您的個人資訊，但不會僅因您同意本隱私條款而採用強制捆綁的方式一攬子處理您的個人資訊。
                        下文將幫您詳細瞭解我們如何收集、使用、存儲、共用、轉讓、公開與保護您的個人資訊，
                        以及您可以如何管理您的個人資訊。在您開始使用我們的產品和服務前，請您務必先仔細閱讀和理解本政策，
                        特別應重點閱讀我們以粗體標識的條款，確保您充分理解和同意之後再開始使用。
                        如對本政策內容有任何疑問、意見或建議，您可通過本隱私條款“您如何聯繫我們”中提供的方式與我們聯繫。</p>
                    <p>(一) 我們如何收集和使用您的個人資訊</p>
                    <p>(二) 我們如何使用Cookie以及同類技術</p>
                    <p>(三) 我們如何共用、轉讓、公開披露和跨境傳輸您的個人資訊</p>
                    <p>(四) 我們如何存儲您的個人資訊</p>
                    <p>(五) 我們如何保護您的個人資訊</p>
                    <p>(六) 您如何管理您的個人資訊</p>
                    <p>(七) 我們如何處理未成年人的個人資訊</p>
                    <p>(八) 隱私條款的修訂和通知</p>
                    <p>(九) 您如何聯繫我們</p>
                    <p>本政策中涉及的專用術語和關鍵字有：
                        快樂搬馬官網：指由快樂搬馬運營的快樂搬馬官方網站：www.happyzebra.tw
                        快樂搬馬：指快樂搬馬管理顧問有限公司提供的電子商戶平臺，快樂搬馬管理顧問有限公司是快樂搬馬官網的互聯網資訊及軟體技術服務提供者，註冊地址：嘉義市友愛路288號5樓之4。
                        個人資訊：是以電子或者其他方式記錄的與已識別或者可識別的自然人有關的各種資訊，包括自然人的姓名、出生日期、身份證件號碼、生物識別資訊、住址、電話號碼、電子郵箱、健康資訊、行蹤資訊等。
                        敏感個人資訊：一旦洩露或者非法使用，容易導致自然人的人格尊嚴受到侵害或者人身、財產安全受到危害的個人資訊，包括：身份證件號碼、個人生物識別資訊、銀行帳號、財產資訊、行蹤軌跡、交易資訊、14歲以下（含）兒童資訊等的個人資訊（我們將在本隱私條款中對具體敏感個人資訊以粗體進行顯著標識）。
                        兒童：指不滿十四周歲的未成年人。</p>
                    <p>一、我們如何收集和使用您的個人資訊</p>
                    <p>在您使用我們提供的產品或服務時，我們需要/可能需要收集和使用您的如下個人資訊：</p>
                    <p>（一） 瀏覽網頁（含移動用戶端）</p>
                    <p>如果您在快樂搬馬上僅需使用瀏覽、搜索等功能，您無需註冊成為我們的用戶以及提供您的個人資訊。</p>
                    <p>（二） 登錄和驗證</p>
                    <p>當您使用帳號登錄快樂搬馬時，借助 Cookie，您可以直接從快樂搬馬的一個頁面跳轉到另一個頁面，而不必在每個頁面上重新登錄；</p>
                    <p>（三） 存儲您的偏好和設置</p>
                    <p>快樂搬馬能夠借助 Cookie 來保存設置，如電腦或移動設備的語言、字體大小、購物車和其他瀏覽偏好等；</p>
                    <p> （四） 基於興趣的廣告</p>
                    <p> 使用 Cookie 來收集有關您線上活動的資訊並發現您的興趣所在，並向您提供與您相關度最高的廣告；</p>
                    <p> （五） 統計分析</p>
                    <p>借助於 Cookie，快樂搬馬可以收集您使用我們快樂搬馬和其他應用程式的資訊，如記錄使用者的單次訪問（使用會話 Cookie）或多次訪問（使用永久 Cookie）。</p>
                    <p>（六） 依法豁免征得同意收集和使用的個人資訊</p>
                    <p>請您理解，在下列情形中，根據法律法規及相關國家標準，我們收集和使用您的個人資訊無需征得您的授權同意：</p>
                    <p> 1.（1）為訂立、履行您作為一方當事人的合同所必需的；</p>
                    <p> 2.（2）為履行法定職責或者法定義務所必需；</p>
                    <p> 3.（3）為應對突發公共衛生事件，或者緊急情況下為保護自然人的生命健康和財產安全所必需；</p>
                    <p> 4.（4）為公共利益實施新聞報導、輿論監督等行為，在合理的範圍內處理個人資訊；</p>
                    <p> 5.（5）在合理範圍內處理個人自行公開或者其他已經合法公開的個人資訊；</p>
                    <p>6.（6）法律、行政法規規定的其他情形。</p>
                    <p>二、我們如何使用Cookie以及同類技術</p>
                    <p>（一） Cookie政策</p>
                    <p>為確保您獲得更為流暢、輕鬆的使用體驗，我們可能會通過小型資料檔案“Cookie”識別您的身份，以説明您減少資訊錄入的次數和頻率，或協助判斷您帳戶的安全狀況。Cookie
                        通常包含識別字、網站名稱以及一些號碼和字元，借助於 Cookie，快樂搬馬能夠存儲您的偏好等資料。我們不會將 Cookie
                        用於本政策所述目的之外的任何用途,存儲您資料的Cookie是唯一的，大部分網路瀏覽器都設有阻止Cookie的功能，它只能被將Cookie發佈給您的域中的web伺服器讀取。</p>
                    <p> （二）Cookie的清除</p>
                    <p> 大多數瀏覽器均為用戶提供了清除瀏覽器緩存資料的功能，您可根據自己的偏好管理或刪除Cookie，並可隨時清除瀏覽器上保存的所有Cookie，您可以在瀏覽器設置功能中進行相應的資料清除操作。如您選擇清除，則需要在每一次使用瀏覽器訪問相關快樂搬馬過程中重新進行用戶設置。您將Cookie清除後，您可能無法使用由我們提供的、依賴於Cookie的服務或相應功能。
                    </p>
                    <p> 三、我們如何共用、轉讓、公開披露及跨境傳輸您的個人資訊</p>
                    <p> （一）共用</p>
                    <p> 1. 共用原則</p>
                    <p> a.授權同意原則：未經您的單獨同意，我們不會共用您的個人資訊。如果關聯方、協力廠商使用資訊的目的超越原授權同意範圍，他們需要重新征得您的同意。</p>
                    <p> b.合法正當與最小必要原則：共用的個人資訊必須具有合法正當目的，且共用的個人資訊以達成目的必要為限。</p>
                    <p> c.安全審慎原則：我們將審慎評估關聯方、協力廠商使用共用資訊的目的，對這些合作方的安全保障能力進行綜合評估，並要求其遵循合作協定。</p>
                    <p> （二） 轉讓</p>
                    <p> 1.我們不會轉讓您的個人資訊給任何其他協力廠商，除非征得您的單獨同意。</p>
                    <p> 2.隨著我們業務的持續發展，我們將有可能進行合併、收購、資產轉讓，您的個人資訊有可能因此而被轉移。在發生前述變更時，我們將按照法律法規及不低於本隱私條款所載明的安全標準要求繼受方保護您的個人資訊，否則我們將要求繼受方重新征得您的授權同意。
                    </p>
                    <p>（三）公開展示</p>
                    <p>我們不會公開披露您的資訊，除非遵循國家法律法規規定或者獲得您的同意。我們公開披露您的個人資訊會採用符合行業內標準的安全保護措施。</p>
                    <p>（五）依法豁免征得同意共用、轉讓、公開披露的個人資訊</p>
                    <p> 請您理解，在下列情形中，根據法律法規及國家標準，我們共用、轉讓、公開披露您的個人資訊無需征得您的授權同意：</p>
                    <p>（1）為訂立、履行您作為一方當事人的合同所必需的；</p>
                    <p>（2）為履行法定職責或者法定義務所必需；</p>
                    <p>（3）為應對突發公共衛生事件，或者緊急情況下為保護自然人的生命健康和財產安全所必需；</p>
                    <p>（4）為公共利益實施新聞報導、輿論監督等行為，在合理的範圍內處理個人資訊；</p>
                    <p>（5）在合理範圍內處理個人自行公開或者其他已經合法公開的個人資訊；</p>
                    <p>（6）法律、行政法規規定的其他情形。</p>
                    <p> 四、我們如何存儲您的個人資訊</p>
                    <p>（一）存儲地點</p>
                    <p> 我們依照法律法規的規定，將在境內運營過程中收集和產生的您的個人資訊存儲於中華人民共和國境內。</p>
                    <p>（二）存儲期限</p>
                    <p> 除法律法規另有規定外，我們僅在為提供服務之目的所必需的期間內保留您的個人資訊。超出必要期限後，我們將對您的個人資訊進行刪除或匿名化處理，但法律法規另有規定的除外。同時，我們也會依照法律法規的規定，在規定情形下主動或者根據您的要求刪除相關個人資訊。在您註銷帳戶後，我們會在十個工作日內刪除您的個人資訊，法律有強制存儲要求的除外。
                    </p>
                    <p> （三）其他本機存放區</p>
                    <p> 快樂搬馬以及某些協力廠商可能在某些產品與服務中使用其他本機存放區技術，例如HTML5 本機存放區。這些技術與上述的 Cookie
                        類似，它們同樣存儲在您的設備中，並且可用於記錄有關您的活動和首選項的某些資訊。但這些技術與標準 Cookie 所使用的設備可能不同，因此您可能無法使用標準瀏覽器工具和設置來控制它們。 </p>
                    <p>五、我們如何保護您的個人資訊</p>
                    <p>我們已採取適當的技術和內部管理措施保護您的個人資訊，包括但不限於：</p>
                    <p>1. 內部管理制度上，我們根據資料的敏感程度和類型的不同採取了資料分類分級制度，並根據分類分級結果進行使用者許可權、使用場景許可權、使用授權許可權、分級審批機制等多方面的許可權限制。</p>
                    <p>2. 技術保障措施上，我們在存儲時採取了不可逆的加密存儲、隔離存儲，在資訊展示和下載時採取了脫敏處理，傳輸時採取了專線傳輸、加密傳輸、金鑰和資料介質隔離傳輸等技術措施，以確保您的個人資訊安全。
                    </p>
                    <p>3.發生個人資訊安全事件後，我們將按照適用法律的要求向您告知：安全事件的基本情況和可能的影響、我們已採取或將要採取的處置措施、您可自主防範和降低風險的建議、對您的補救措施等。同時，我們還將按照監管部門要求，上報個人資訊安全事件的處置情況。
                    </p>
                    <p>4.儘管已經採取了上述合理有效措施，並已經遵守了相關法律規定要求的標準，但請您理解，由於技術的限制以及可能存在的各種惡意手段，在互聯網行業，即便竭盡所能加強安全措施，也不可能始終保證資訊百分之百的安全，我們將盡力確保您提供給我們的個人資訊的安全性。
                    </p>
                    <p> 5.您知悉並理解，您接入我們的服務所用的系統和通訊網路，有可能因我們可控範圍外的因素而出現問題。因此，我們強烈建議您採取積極措施保護個人資訊的安全，包括但不限於使用複雜密碼、定期修改密碼、不將自己的帳號密碼及相關個人資訊透露給他人等。
                    </p>
                    <p>6.我們會制定應急處理預案，並在發生使用者資訊安全事件時立即啟動應急預案，努力阻止這些安全事件的影響和後果擴大。一旦發生使用者資訊安全事件（洩露、丟失）後，我們將按照法律法規的要求，及時向您告知：安全事件的基本情況和可能的影響、我們已經採取或將要採取的處置措施、您可自主防範和降低風險的建議、對您的補救措施。我們將及時將事件相關情況以推送通知、郵件、信函、短信及相關形式告知您，難以逐一告知時，我們會採取合理、有效的方式發佈公告。同時，我們還將按照相關監管部門要求，上報使用者資訊安全事件的處置情況。
                    </p>
                    <p>7.您一旦離開快樂搬馬官網，瀏覽或使用其他網站、服務及內容資源，我們將沒有能力和直接義務保護您在快樂搬馬官網服務及相關服務之外的軟體、網站提交的任何個人資訊，無論您登錄、瀏覽或使用上述軟體、網站是否基於快樂搬馬官網服務的連結或引導。
                    </p>
                    <p> 六.您如何管理您的個人資訊</p>
                    <p>我們非常重視您對個人資訊的管理，並盡全力保護您對於您個人資訊的查詢、訪問、撤回同意授權、註銷帳號、投訴舉報等相關權利，以使您有能力保障您的隱私和資訊安全。</p>
                    <p>（一）撤回授權範圍</p>
                    <p> 如您希望撤回對您的個人資訊的授權，您可以通過我們的在線客服與我們聯繫。</p>
                    <p> （二）查詢、更正和補充您的資訊</p>
                    <p> 您可以在快樂搬馬官網登錄帳戶後，在“用戶中心”查詢、修改以及補充您的手機號或電子郵箱。</p>
                    <p>（三）刪除您的資訊</p>
                    <p>在您登出帳戶後，您的個人資訊將會被刪除，您將無法使用帳號對應的服務（您也將無法查詢、瀏覽、使用已領取的優計畫優惠券）。</p>
                    <p> 在以下情形中，您可以向我們提出刪除個人資訊的請求：</p>
                    <p> a.處理目的已實現、無法實現或者為實現處理目的不再必要；</p>
                    <p> b.我們停止提供產品或者服務，或者保存期限已屆滿；</p>
                    <p> c.個人撤回同意；</p>
                    <p>d.我們違反法律、行政法規或者違反約定處理個人資訊；</p>
                    <p>e.法律、行政法規規定的其他情形。</p>
                    <p> 請您理解，因為適用的法律和安全技術限制，我們可能無法立即從備份系統中刪除相應的資訊，我們將安全地存儲您的個人資訊並限制對其的任何進一步的處理，直到備份可以清除或實現暱名化。</p>
                    <p> （四）註銷您的帳戶</p>
                    <p> 您可以通過我們的在客服登出您的帳戶。</p>
                    <p> （五）投訴舉報</p>
                    <p> 如果您認為您的個人資訊權利可能受到侵害，或者發現侵害個人資訊權利的線索，您可以聯絡我們的在線客服與我們回饋。我們核查後會及時回饋您的投訴與舉報。</p>
                    <p>（六）回應您的上述請求</p>
                    <p> 為保障您的帳戶安全，您向我們提出上述請求時，我們可能會先要求您驗證自己的身份（如要求您提供身份驗證資訊或其他方式），然後再處理您的請求。
                        對於您向我們提出的上述請求，我們將在15天內做出答覆。如您不滿意我們的答覆，還可以通過我們的在線客服進行投訴。
                        對於您合理的請求，我們原則上不收取費用，但對多次重複、超出合理限度的請求，我們將酌情收取一定費用。對於與您的身份不直接關聯的資訊、無端重複資訊，或者需要過多技術手段（例如，需要開發新系統或從根本上改變現行慣例）、給他人合法權益帶來風險或者不切實際的請求，我們可能會予以拒絕。
                    </p>
                    <p>在以下情形中，按照法律法規要求，我們將無法回應您的請求：</p>
                    <p> 1、與我們履行法律法規規定的義務相關的；</p>
                    <p>2、與國家安全、國防安全直接相關的；</p>
                    <p>3、與公共安全、公共衛生、重大公共利益直接相關的；</p>
                    <p>4、與刑事犯罪偵查、起訴、審判和執行判決等直接相關的；</p>
                    <p>5、有充分證據表明您存在主觀惡意或濫用權利的；</p>
                    <p>6、出於維護您或其他個人的生命、財產等重大合法權益但又很難得到本人授權同意的；</p>
                    <p>7、響應您的請求將導致您或其他個人、組織的合法權益受到嚴重損害的；</p>
                    <p>8、涉及商業秘密的。</p>
                    <p>七、我們如何處理未成年人的個人資訊</p>
                    <p> 1.您在使用我們的服務或參與相關報名活動中我們推定您具有相應的民事行為能力。如您為未滿18周歲的未成年人，我們要求您請您的父母或其他監護人（統稱為“監護人”）仔細閱讀本隱私條款，並在征得您的監護人同意的前提下使用我們的服務或向我們提供資訊。我們不向未滿14周歲的兒童提供服務，如您為兒童，請您立即停止使用我們的服務並通知您的監護人。
                    </p>
                    <p>2.如果有事實證明未成年人在未取得監護人同意的情況下註冊使用了我們的產品與/或服務，我們會與相關監護人協商，並設法儘快刪除相關個人資訊。</p>
                    <p>3.若您是未成年人的監護人，發現我們在不知情的情況下誤收集了未成年人的個人資訊，或者您對您所監護的未成年人的個人資訊有疑問，請通過本政策中提到的聯繫方式與我們聯繫。</p>
                    <p> 八、隱私條款的修訂和通知</p>
                    <p>請您理解，為適應社會環境的發展以及為向您提供更好的服務，我們的業務也會不斷發展與更新，為此我們可能會適時修訂本政策，且標注本政策最新更新的日期，並經公示後生效。本隱私條款更新後，我們將會在快樂搬馬官網頁面通過彈窗、頁面提示等方式告知您。您可以隨時在快樂搬馬官網的“隱私條款”處查閱本隱私條款。
                    </p>
                    <p> 九、您如何聯繫我們</p>
                    <p>如果您對本隱私條款內容有任何疑問、意見或建議，或者您對我們收集、使用或披露您的個人資訊有任何投訴、建議、疑問，您可以通過以下方式與我們聯繫，我們將在15天內回復您的請求：</p>
                    <p> 聯繫郵箱：hi@happyzebra.tw</p>
                    <p>聯繫電話： 0927710959</p>
                    <p> 聯繫地址： 嘉義市友愛路288號5樓之4</p>
                    <p> 如果您對我們的回復不滿意，特別是您認為我們的個人資訊處理行為損害了您的合法權益，您還可以通過向被告住所地有管轄權的法院提起訴訟來尋求解決方案。</p>
                </div>
            </div>
        </div>
    </NuxtLayout>
</template>

<script setup lang="ts">
definePageMeta({
    layout: false,
})
</script>

<style scoped>
p {
    line-height: 25px;
    margin-bottom: 5px;
}

h3 {
    margin: 15px 0;
}
</style>