<template>
    <NuxtLayout name="personal-center">
        <div>
            <CoreshopTitle :title="$t('用户协议')"></CoreshopTitle>
            <section class="cs-p-10 cs-p-b-20 cs-background-color-white">
            <!-- <section v-if="getAgentInfo.data" class="cs-p-10 cs-p-b-20 cs-background-color-white"> -->
                <!-- <p class="cs-font-size-16 cs-text-align-center cs-p-20">{{getAgentInfo.data?.title}}</p>
                <p class="cs-font-size-14 cs-text-align-center cs-m-20 cs-color-gray">{{getAgentInfo.data?.createTime}}</p> -->
                <!-- <div class="cs-font-size-14 cs-line-height-25" v-html="getAgentInfo.data?.contentBody"></div> -->

                <p class="cs-font-size-16 cs-text-align-center cs-p-20">快樂搬馬用戶服務條款</p>
                <p class="cs-font-size-14 cs-text-align-center cs-m-20 cs-color-gray">2024-5-23</p>
                <div class="cs-font-size-14 cs-line-height-25">
                    <h3>【總則】</h3>
                    <p>針對快樂搬馬管理顧問有限公司所屬電子商務平臺“快樂搬馬”，以下簡稱平臺。在業務開展過程中制定本服務協定、交易規則。為了保障“快樂搬馬”平臺各方主體的合法權益，規範各方主體行為，維護商務市場秩序，遵守和維護國家法律法規，制定本方案。</p>
                    <p>“快樂搬馬”平臺所有電子商務活動，適用本方案。本方案所稱電子商務活動，是指通過互聯網等資訊網路銷售商品或者提供服務的經營活動。 《中華民國電子商務法》對銷售商品或者提供服務有規定的，適用其規定。金融類產品和服務，利用資訊網路提供新聞資訊、音視頻節目、出版以及文化產品等內容方面的服務，根據《中華民國電子商務法》相關規定，不適用本方案。</p>

                    <h3>【服務協定】</h3>
                    <p>1、平臺將遵循公開、公平、公正的原則，制定平臺服務協定和交易規則，明確進入和退出平臺、商品和服務品質保障、消費者權益保護、個人資訊保護等方面的權利和義務。</p>
                    <p>2、平臺將記錄、保存平臺上發佈的商品和服務資訊、交易資訊，並確保資訊的完整性、保密性、可用性。商品和服務資訊、交易資訊保存時間自交易完成之日起不少於三年；法律、行政法規另有規定的，依照其規定。</p>
                    <p>3、平臺將提供明示使用者資訊查詢、更正、刪除以及使用者登出的方式、程式，不得對使用者資訊查詢、更正、刪除以及用戶註銷設置不合理條件。 平臺收到使用者資訊查詢或者更正、刪除的申請的，應當在核實身份後及時提供查詢或者更正、刪除使用者資訊。用戶註銷的，平臺應當立即刪除該使用者的資訊；依照法律、行政法規的規定或者雙方約定保存的，依照其規定。</p>
                    <p>4、平臺收集、使用其使用者的個人資訊，應當遵守法律、行政法規有關個人資訊保護的規定。</p>
                    <p>5、有關主管部門依照法律、行政法規的規定要求平臺提供有關電子商務資料資訊的，平臺將依法提供。</p>
                    <p>6、平臺採取必要措施保護資料資訊的安全，並對其中的個人資訊、隱私和商業秘密嚴格保密，不得洩露、出售或者非法向他人提供。</p>
                    <p>7、平臺必須要求申請進入平臺銷售商品或者提供服務的經營者提交其身份、位址、聯繫方式、行政許可等真實資訊，進行核驗、登記，建立登記檔案，並定期核驗更新。</p>
                    <p>8、平臺將採取技術措施和其他必要措施保證其網路安全、穩定運行，防範網路違法犯罪活動，有效應對網路安全事件，保障電子商務交易安全。</p>
                    <p>9、平臺在修改平臺服務協定和交易規則時，將在其首頁顯著位置公開徵求意見，採取合理措施確保有關各方能夠及時充分表達意見。修改內容應當至少在實施前七日予以公示。</p>
                    <p>10、平臺不得利用服務協定、交易規則以及技術等手段，對平臺內經營者在平臺內的交易、交易價格以及與其他經營者的交易等進行不合理限制或者附加不合理條件，或者向平臺內入駐經營者收取不合理費用。</p>
                    <p>11、平臺依據平臺服務協定和交易規則對平臺內入駐經營者違反法律、法規的行為實施警示、暫停或者終止服務等措施的，應當及時公示。</p>
                    <p>12、平臺開展自營業務過程中，應當以顯著方式區分標記自營業務和平臺內入駐經營者開展的業務，不得誤導消費者。 平臺對標記為自營的業務依法承擔商品銷售者或者服務提供者的民事責任。</p>
                    <h3>【交易規則】</h3>
                    <p>1、“快樂搬馬”平臺交易行為，適用《中華民國民法總則》《中華民國合同法》《中華民國電子簽名法》等法律的規定。</p>
                    <p>2、交易當事人使用自動資訊系統訂立或者履行合同的行為對使用該系統的當事人具有法律效力。 在交易過程中推定當事人具有相應的民事行為能力。但是，有相反證據足以推翻的除外。</p>
                    <p>3、平臺入駐經營者發佈的商品或者服務資訊符合要約條件的，使用者選擇該商品或者服務並提交訂單成功，合同成立。當事人另有約定的，從其約定。 平臺入駐經營者不得以格式條款等方式約定使用者支付價款後合同不成立；格式條款等含有該內容的，其內容無效。</p>
                    <p>4、平臺入駐經營者應當清晰、全面、明確地告知使用者交易的步驟、注意事項、下載方法等事項，並保證用戶能夠便利、完整地閱覽和下載。 平臺入駐經營者應當保證使用者在提交訂單前可以更正輸入錯誤。</p>
                    <p>5、訂單標的為交付商品並採用快遞物流方式交付的，收貨人簽收時間為交付時間。訂單標的為提供服務的，生成的電子憑證或者實物憑證中載明的時間為交付時間；前述憑證沒有載明時間或者載明時間與實際提供服務時間不一致的，實際提供服務的時間為交付時間。 訂單標的為採用線上傳輸方式交付的，訂單標的進入使用者指定的特定系統並且能夠檢索識別的時間為交付時間。 訂單當事人對交付方式、交付時間另有約定的，從其約定。</p>
                    <p>6、交易當事人可以選擇約定採用快遞物流方式交付商品。 快遞物流服務提供者為平臺經營者和用戶提供快遞物流服務，應當遵守法律、行政法規，並應當符合承諾的服務規範和時限。快遞物流服務提供者在交付商品時，應當提示收貨人當面查驗；交由他人代收的，應當經收貨人同意。 快遞物流服務提供者應當按照規定使用環保包裝材料，實現包裝材料的減量化和再利用。 快遞物流服務提供者在提供快遞物流服務的同時，可以接受平臺經營者的委託提供代收貨款服務。</p>
                    <p>7、交易當事人可以約定採用電子支付方式支付價款。 電子支付服務提供者為交易提供電子支付服務，應當遵守國家規定，告知使用者電子支付服務的功能、使用方法、注意事項、相關風險和收費標準等事項，不得附加不合理交易條件。電子支付服務提供者應當確保電子支付指令的完整性、一致性、可跟蹤稽核和不可篡改。 電子支付服務提供者應當向使用者免費提供對賬服務以及最近三年的交易記錄。</p>
                    <p>8、使用者應當妥善保管交易密碼、電子簽名資料等安全工具。用戶發現安全工具遺失、被盜用或者未經授權的支付的，應當及時通知快樂搬馬電商平臺和電子支付服務提供者。 未經授權的支付造成的損失，由電子支付服務提供者承擔；電子支付服務提供者能夠證明未經授權的支付是因用戶的過錯造成的，不承擔責任。 電子支付服務提供者發現支付指令未經授權，或者收到使用者支付指令未經授權的通知時，應當立即採取措施防止損失擴大。電子支付服務提供者未及時採取措施導致損失擴大的，對損失擴大部分承擔責任。</p>
                </div>
            </section>
            <!-- <CoreshopNoData v-else :text="$t('暂无数据')"></CoreshopNoData> -->
        </div>
    </NuxtLayout>
</template>

<script setup lang='ts'>
// import { queryArticleInfo } from '@/composables/notice';
// import { useConfigStore } from '@/store';
// import { Result } from "@/model/result";
// import { Article } from '@/model//article';
// import { Config } from '@/model/config';

definePageMeta({
    layout: false,
})

// const config: Config = useConfigStore().getConfig;

// const getAgentInfo: Result<Article> = await queryArticleInfo({
//     id: config.userAgreementId
// });
</script>

<!-- <style lang='scss' scoped>
.van-empty{
    background: #fff;
    margin: 10px;
    border-radius: 8px;
}
</style> -->
<style scoped>
p {
    line-height: 25px;
    margin-bottom: 5px;
    color: #333;
}

h3 {
    margin: 15px 0;
}
</style>